EDT/УТ/src/Catalogs/Смены/Смены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Смены</name>
  <predefined>
    <items>
      <name>Смена1</name>
      <description>Смена 1</description>
    </items>
    <items>
      <name>Смена2</name>
      <description>Смена 2</description>
    </items>
  </predefined>
  <attributes>
    <name>ИнтервалЗагрузкиНакладной003_С</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалЗагрузкиНакладной003_По</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВременнойИнтервал</name>
    <type>
      <types>CatalogRef.ВременныеИнтервалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРаботыВодителей</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРаботыВодителей</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьЧаса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалДоставкиС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьИнтервалДоставкиС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьГруппыПолигоновМаршрутизации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЛогистическиеБрейки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрефиксНумерацииПалет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСмены</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалДоставкиПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьИнтервалДоставкиПо</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПочтовыеАдреса</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИнформироватьОПриходеНакладной</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГруппыПолигоновМаршрутизации</name>
    <attributes>
      <name>ГруппаПолигоновМаршрутизации</name>
      <type>
        <types>CatalogRef.ГруппыПолигоновМаршрутизации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЛогистическиеБрейки</name>
    <attributes>
      <name>ЛогистическийБрейк</name>
      <type>
        <types>CatalogRef.ЛогистическиеБрейки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/УТ/src/Catalogs/Смены/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТекущаяСхемаЛогистическихБрейков = МаршрутизацияЗаказовСервер.ОпределитьАктуальнуюСхемуЛогистическихБрейков();
	ОбновитьВидимостьЭлементов();
	
	Если Не РольДоступна("Админы") Тогда
		ТолькоПросмотр = Истина;
	КонецеСли;	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьЭлементов()
	Если Объект.ИспользоватьИнтервалДоставкиС Тогда
		Элементы.ИнтервалДоставкиС.Видимость = Истина;
	Иначе
		Элементы.ИнтервалДоставкиС.Видимость = Ложь;
	КонецЕсли;
	
	Если Объект.ИспользоватьЛогистическиеБрейки Тогда
		Элементы.ГруппаЛБ.Видимость = Истина;
	Иначе
		Элементы.ГруппаЛБ.Видимость = Ложь;
	КонецЕсли;
	
	Если Объект.ИспользоватьГруппыПолигоновМаршрутизации Тогда
		Элементы.ГруппаПМ.Видимость = Истина;
	Иначе
		Элементы.ГруппаПМ.Видимость = Ложь;
	КонецЕсли;
	
	//+Степанов Задача № 2620 
	Если Объект.ИспользоватьИнтервалДоставкиПо Тогда
		Элементы.ИнтервалДоставкиПо.Видимость = Истина;
	Иначе
		Элементы.ИнтервалДоставкиПо.Видимость = Ложь;
	КонецЕсли;	
	//-Степанов Задача № 2620
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьИнтервалДоставкиСПриИзменении(Элемент)
	ОбновитьВидимостьЭлементов()
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьЛогистическиеБрейкиПриИзменении(Элемент)
	ОбновитьВидимостьЭлементов()
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьГруппыПолигоновМаршрутизацииПриИзменении(Элемент)
	ОбновитьВидимостьЭлементов()
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьИнтервалДоставкиПоПриИзменении(Элемент)
	ОбновитьВидимостьЭлементов();
КонецПроцедуры
